<template>
  <div>
    <el-button type="text" @click="open">寻宠发布必读</el-button>
  </div>
</template>

<script>
  export default {
    methods: {
      open() {
        this.$alert('1、本站内收录的所有教程与资料均来自于互联网，其版权均归原作者及其网站所有，本站虽力求保存原有的版权信息，但由于诸多原因，可能导致无法确定其真实来源，请原作者原谅！如果您对本站教程与资料的归属存有异议，请立即通知宠它，情况属实，我们会第一时间予以删除，并同时向您表示歉意！看着爱宠网真诚的小眼神，绝对不是故意侵犯原作者版权！\n'+

        '2、本网站禁止制作、复制、发布、传播等具有反动、色情、暴力、淫秽等内容的信息，一经发现，立即删除。若您因此触犯法律，我们对此不承担任何法律责任。'+

        '3、本网站会员自行上传或通过网络收集的资源，我们仅提供一个展示、交流的平台，不对其内容的准确性、真实性、正当性、合法性负责，也不承担任何法律责任。'+

        '4、任何单位或个人认为通过本网站网页内容可能涉嫌侵犯其著作权，应该及时向我们提出书面权利通知，并提供身份证明、权属证明及详细侵权情况证明。我们收到上述法律文件后，将会依法尽快处理。', {
          confirmButtonText: '确定',
          callback: action => {
            this.$message({
              type: 'info',
              message: `action: ${ action }`
            });
          }
        });
      }
    }
  }
</script>

<style scoped>
  div{
    display: inline-block;
  }

</style>
